tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "openresty/brew"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast, highly customisable system info script
brew "neofetch"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Persistent key-value database, with built-in net interface
brew "redis"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.2"
# Scalable Web Platform by Extending NGINX with Lua
brew "openresty/brew/openresty"
# Minimal installer for conda
cask "miniconda"
