tap "druagoon/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Easily create and use cli based on bash script
brew "argc"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Binary installation for rust projects
brew "cargo-binstall"
# Utility for managing cargo dependencies from the command-line
brew "cargo-edit"
# Show what Rust code looks like with macros expanded
brew "cargo-expand"
# Cargo subcommand for displaying when Rust dependencies are out of date
brew "cargo-outdated"
# Cargo subcommand `release`: everything about releasing a rust crate
brew "cargo-release"
# Find unused dependencies in Cargo.toml
brew "cargo-udeps"
# Cargo subcommand for checking and applying updates to installed executables
brew "cargo-update"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Spell checker for code
brew "cspell"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# List, fetch and generate .gitignore templates
brew "git-ignore"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern, extensible Python project management
brew "hatch"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Sort Python imports automatically
brew "isort"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tool for querying IP geographic information and CDN provider
brew "nali"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# TOML toolkit written in Rust
brew "taplo"
# TCP connect to the given IP/port combo
brew "tcping"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Lightweight and flexible bash tool for managing dotfiles efficiently
brew "druagoon/brew/dotf"
# CLI for creating conventional-commits friendly commit messages
brew "druagoon/brew/git-cm"
# Personal command-line tool includes various commonly used utilities
brew "druagoon/brew/icli"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Application launcher and productivity software
cask "alfred"
# iOS App Store alternative
cask "altserver"
# Application uninstaller
cask "appcleaner"
# Opensource IDE for exploring and testing api's
cask "bruno"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# AI chatbot for many LLMs
cask "chatwise"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Continuation of Clash Verge - A Clash Meta GUI based on Tauri
cask "clash-verge-rev"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Dictionary and translator app
cask "easydict"
# Web browser
cask "firefox"
# Utility to hide menu bar items
cask "hiddenbar"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Organize and sort apps and folders on LaunchPad following specific rules
cask "launchpadder"
# Display technical and tag data for video and audio files
cask "mediainfo"
# Modern GUI for Redis
cask "medis"
# Minimal installer for conda
cask "miniconda"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Markdown writing, note taking, and static blog generator app
cask "mweb-pro"
# Get up and running with large language models locally
cask "ollama"
# All system and utility switches in one place
cask "one-switch"
# Replacement for Docker Desktop
cask "orbstack"
# PDF reader, editor and annotator
cask "pdf-expert"
# Converts and edits video, audio or image files
cask "permute"
# Used to access context-specific actions when text is selected
cask "popclip"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Screenshot measurement and annotation tool
cask "shottr"
# Graphical client for Git version control
cask "sourcetree"
# Network toolbox
cask "surge"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Extract text from images and other digital documents
cask "textsniper"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
mas "AdGuard for Safari", id: 1440147259
mas "AnyKit", id: 1435159279
mas "Apple Configurator", id: 1037126344
mas "Bob", id: 1630034110
mas "DockX", id: 6452276577
mas "Enpass", id: 732710998
mas "Futubull Legacy", id: 664513913
mas "GarageBand", id: 682658836
mas "Immersive Translate", id: 6447957425
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "MarkMark", id: 6475077023
mas "MenubarX", id: 1575588022
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Moom Classic", id: 419330170
mas "NetEaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "OneTab", id: 1540160809
mas "OpenCat", id: 6445999201
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "TencentMeeting", id: 1484048379
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 409789998
mas "Userscripts-Mac-App", id: 1463298887
mas "Velja", id: 1607635845
mas "WeChat", id: 836500024
mas "WeCom", id: 1189898970
mas "Whisper Transcription", id: 1668083311
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexdima.copy-relative-path"
vscode "bierner.markdown-mermaid"
vscode "burkeholland.simple-react-snippets"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "coolbear.systemd-unit-file"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "k--kato.intellij-idea-keybindings"
vscode "leetcode.vscode-leetcode"
vscode "lextudio.restructuredtext"
vscode "luggage66.awk"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "quicktype.quicktype"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "rlnt.keep-a-changelog"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "sharat.vscode-brewfile"
vscode "shopify.ruby-lsp"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "trond-snekvik.simple-rst"
vscode "tyriar.vscode-terminal-here"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "webfreak.debug"
vscode "yzhang.markdown-all-in-one"
vscode "zhouronghui.propertylist"
vscode "zhuangtongfa.material-theme"
