tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tool for querying IP geographic information and CDN provider
brew "nali"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# TCP connect to the given IP/port combo
brew "tcping"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool for multi-language users
cask "input-source-pro"
# Minimal installer for conda
cask "miniconda"
